{
  "<PAD>": 0,
  "<UNK>": 1,
  "0": 2,
  "00": 3,
  "01": 4,
  "02": 5,
  "03": 6,
  "04": 7,
  "05": 8,
  "06": 9,
  "07": 10,
  "08": 11,
  "09": 12,
  "0a": 13,
  "0a1f88b57h": 14,
  "0a1h": 15,
  "0a4378b7h": 16,
  "0ah": 17,
  "0b": 18,
  "0c": 19,
  "0c6h": 20,
  "0d": 21,
  "0dah": 22,
  "0e": 23,
  "0e0825ea9h": 24,
  "0e8h": 25,
  "0efh": 26,
  "0f": 27,
  "0f1h": 28,
  "0f7h": 29,
  "0f9h": 30,
  "0ff0a7456h": 31,
  "10": 32,
  "11": 33,
  "12": 34,
  "13": 35,
  "14": 36,
  "16": 37,
  "17": 38,
  "18": 39,
  "19": 40,
  "1a": 41,
  "1b": 42,
  "1c": 43,
  "1d": 44,
  "1e": 45,
  "1f": 46,
  "20": 47,
  "21": 48,
  "22": 49,
  "23": 50,
  "24": 51,
  "25": 52,
  "26": 53,
  "26h": 54,
  "27": 55,
  "28": 56,
  "29": 57,
  "2a": 58,
  "2b": 59,
  "2c": 60,
  "2d": 61,
  "2e": 62,
  "2f": 63,
  "30": 64,
  "31": 65,
  "32": 66,
  "33": 67,
  "34": 68,
  "35": 69,
  "36": 70,
  "37": 71,
  "38": 72,
  "39": 73,
  "39h": 74,
  "3a": 75,
  "3b": 76,
  "3c": 77,
  "3d": 78,
  "3e": 79,
  "3f": 80,
  "40": 81,
  "41": 82,
  "41h": 83,
  "42": 84,
  "43": 85,
  "44": 86,
  "45": 87,
  "46": 88,
  "47": 89,
  "48": 90,
  "49": 91,
  "4a": 92,
  "4b": 93,
  "4c": 94,
  "4d": 95,
  "4e": 96,
  "4f": 97,
  "50": 98,
  "51": 99,
  "52": 100,
  "53": 101,
  "54": 102,
  "55": 103,
  "56": 104,
  "57": 105,
  "58": 106,
  "59": 107,
  "5a": 108,
  "5b": 109,
  "5bh": 110,
  "5c": 111,
  "5d": 112,
  "5e": 113,
  "5f": 114,
  "60": 115,
  "61": 116,
  "62": 117,
  "63": 118,
  "63a04827h": 119,
  "64": 120,
  "65": 121,
  "66": 122,
  "66h": 123,
  "67": 124,
  "67h": 125,
  "68": 126,
  "69": 127,
  "6a": 128,
  "6b": 129,
  "6c": 130,
  "6d": 131,
  "6e": 132,
  "6f": 133,
  "70": 134,
  "71": 135,
  "71abccfch": 136,
  "72": 137,
  "73": 138,
  "74": 139,
  "74244139h": 140,
  "75": 141,
  "76": 142,
  "77": 143,
  "78": 144,
  "79": 145,
  "7a": 146,
  "7b": 147,
  "7c": 148,
  "7ch": 149,
  "7d": 150,
  "7e": 151,
  "7f": 152,
  "80": 153,
  "81": 154,
  "82": 155,
  "83": 156,
  "83000018h": 157,
  "84": 158,
  "85": 159,
  "86": 160,
  "87": 161,
  "88": 162,
  "89": 163,
  "8a": 164,
  "8b": 165,
  "8bh": 166,
  "8c": 167,
  "8d": 168,
  "8e": 169,
  "8eh": 170,
  "8f": 171,
  "90": 172,
  "91": 173,
  "92": 174,
  "93": 175,
  "94": 176,
  "95": 177,
  "96": 178,
  "97": 179,
  "98": 180,
  "99": 181,
  "9a": 182,
  "9b": 183,
  "9c": 184,
  "9d": 185,
  "9e": 186,
  "9f": 187,
  "a0": 188,
  "a1": 189,
  "a2": 190,
  "a3": 191,
  "a4": 192,
  "a5": 193,
  "a6": 194,
  "a7": 195,
  "a8": 196,
  "a9": 197,
  "aa": 198,
  "aas": 199,
  "ab": 200,
  "ac": 201,
  "ad": 202,
  "adc": 203,
  "add": 204,
  "ae": 205,
  "af": 206,
  "and": 207,
  "arpl": 208,
  "b0": 209,
  "b1": 210,
  "b2": 211,
  "b3": 212,
  "b4": 213,
  "b5": 214,
  "b6": 215,
  "b7": 216,
  "b8": 217,
  "b9": 218,
  "ba": 219,
  "bb": 220,
  "bc": 221,
  "bd": 222,
  "be": 223,
  "bf": 224,
  "bsf": 225,
  "bsr": 226,
  "byte_10001000": 227,
  "byte_401109": 228,
  "c0": 229,
  "c1": 230,
  "c2": 231,
  "c3": 232,
  "c4": 233,
  "c5": 234,
  "c6": 235,
  "c7": 236,
  "c8": 237,
  "c9": 238,
  "ca": 239,
  "call": 240,
  "cb": 241,
  "cc": 242,
  "cd": 243,
  "cdq": 244,
  "ce": 245,
  "cf": 246,
  "clc": 247,
  "cld": 248,
  "cmovb": 249,
  "cmovnz": 250,
  "cmp": 251,
  "d0": 252,
  "d1": 253,
  "d2": 254,
  "d3": 255,
  "d4": 256,
  "d5": 257,
  "d6": 258,
  "d7": 259,
  "d8": 260,
  "d9": 261,
  "da": 262,
  "das": 263,
  "dc": 264,
  "de": 265,
  "dec": 266,
  "df": 267,
  "div": 268,
  "dword_410028": 269,
  "e0": 270,
  "e1": 271,
  "e2": 272,
  "e3": 273,
  "e4": 274,
  "e5": 275,
  "e6": 276,
  "e7": 277,
  "e8": 278,
  "e9": 279,
  "ea": 280,
  "eb": 281,
  "ec": 282,
  "ed": 283,
  "ee": 284,
  "ef": 285,
  "f0": 286,
  "f1": 287,
  "f2": 288,
  "f3": 289,
  "f4": 290,
  "f5": 291,
  "f6": 292,
  "f7": 293,
  "f8": 294,
  "f9": 295,
  "fa": 296,
  "fadd": 297,
  "faddp": 298,
  "fb": 299,
  "fc": 300,
  "fcom": 301,
  "fd": 302,
  "fdiv": 303,
  "fe": 304,
  "ff": 305,
  "ficomp": 306,
  "fild": 307,
  "fld": 308,
  "fld1": 309,
  "fldz": 310,
  "fmul": 311,
  "fmulp": 312,
  "fnstsw": 313,
  "fst": 314,
  "fstp": 315,
  "fsub": 316,
  "fucomp": 317,
  "fxch": 318,
  "hlt": 319,
  "icebp": 320,
  "idiv": 321,
  "imul": 322,
  "in": 323,
  "inc": 324,
  "insb": 325,
  "int": 326,
  "into": 327,
  "ja": 328,
  "jb": 329,
  "jbe": 330,
  "jg": 331,
  "jge": 332,
  "jl": 333,
  "jle": 334,
  "jmp": 335,
  "jnb": 336,
  "jno": 337,
  "jnp": 338,
  "jns": 339,
  "jnz": 340,
  "jo": 341,
  "jp": 342,
  "jz": 343,
  "lea": 344,
  "leave": 345,
  "lodsb": 346,
  "loopne": 347,
  "mov": 348,
  "movsb": 349,
  "movsx": 350,
  "movzx": 351,
  "neg": 352,
  "nop": 353,
  "not": 354,
  "offset": 355,
  "or": 356,
  "out": 357,
  "outsb": 358,
  "outsd": 359,
  "pop": 360,
  "popa": 361,
  "push": 362,
  "pusha": 363,
  "pushf": 364,
  "rcl": 365,
  "rep": 366,
  "retf": 367,
  "retn": 368,
  "ror": 369,
  "sahf": 370,
  "sar": 371,
  "sbb": 372,
  "scasd": 373,
  "setalc": 374,
  "setnz": 375,
  "setz": 376,
  "shl": 377,
  "shr": 378,
  "sti": 379,
  "stosb": 380,
  "sub": 381,
  "test": 382,
  "xchg": 383,
  "xor": 384
}